    1 ## what is data wrangling?
It is one of the most imporatant step before Data Analysis .In which first of we will perform the different operation on data such as cleaning,filtering,groupings etc

In [34]:
import pandas as pd
import numpy as np
import seaborn as sns

In [35]:
kashti=sns.load_dataset("titanic")
ks1=kashti
ks2=kashti

In [36]:
kashti.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [37]:
# how to change in one column value
(kashti['age']*2).head(10)

0     44.0
1     76.0
2     52.0
3     70.0
4     70.0
5      NaN
6    108.0
7      4.0
8     54.0
9     28.0
Name: age, dtype: float64

### Dealing with missing values
 - in data set a missing value maybe NaN(NOT a number )n/A or a blank/
-  jab kisi box mai data ba ho
  
***stpes***/

    1 try to collect  data again/

    2 stuck out the missing value column/
    
    3 replace the missing value/
    
   ### how handle missing value?
   - taking average of column in which null value exist then write down average on empty space 
   - write down mode in missing value section 
   - machine learning algo is aslo use here.
   - live it like that

In [38]:
## find the mising value
kashti.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [39]:
# drop out the column for missing values handling
kashti.dropna(subset=['deck'],axis=0,inplace=True)
kashti.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

In [40]:
kashti.dropna()
kashti.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

In [41]:
kashti=kashti.dropna()
kashti.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [42]:
kashti.shape

(182, 15)

In [43]:
ks1.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

### Step:Replacing a missing value

In [44]:
mean=ks1["age"].mean()
mean

35.77945652173913

## Assignment

In [45]:
ks1["embarked"]=ks1["embarked"].replace(np.nan,mean)
ks1["age"]=ks1["age"].replace(np.nan,mean)

In [46]:
ks1.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    2
alive          0
alone          0
dtype: int64

## Data Formating/standarized ?
- Df means a data should be written in always same keywords such as 
    - sheikhupura not use (skp).
    -  lahore not use (lhr).
    -   Multan not use (Mlt)
    -   ft not bequal cm

In [47]:
ks1.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

#### column type convertion

In [48]:
ks1['survived']=ks1['survived'].astype('float64')
ks1.dtypes

survived        float64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [49]:
## convert the age into days instead of year
ks1['age']*365

1      13870.0
3      12775.0
6      19710.0
10      1460.0
11     21170.0
        ...
871    17155.0
872    12045.0
879    20440.0
887     6935.0
889     9490.0
Name: age, Length: 203, dtype: float64

### Assignment

In [50]:
ks1["age"]=ks1["age"].astype(int)

In [51]:
ks1.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1.0,1,female,38,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1.0,1,female,35,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0.0,1,male,54,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1.0,3,female,4,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1.0,1,female,58,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [52]:
ks1.rename(columns={"age":"age in days"},inplace=True)
ks1.head()

,survived,pclass,sex,age in days,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1.0,1,female,38,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1.0,1,female,35,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0.0,1,male,54,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1.0,3,female,4,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1.0,1,female,58,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

###

## DATA NORMILIZATION.
- IN variance if your bell curve is equal in right and left side its means your data is normal

### Method of data normilization
- simple feature scaling
   - x(new)=x(old)/x(max)
 - Min-Max method
 - Z-score(standard score)-3-to- +3
 - log transformation

In [53]:
ks1=ks1[["age in days","fare"]]
ks1

     age in days     fare
1             38  71.2833
3             35  53.1000
6             54  51.8625
10             4  16.7000
11            58  26.5500
..           ...      ...
871           47  52.5542
872           33   5.0000
879           56  83.1583
887           19  30.0000
889           26  30.0000

[203 rows x 2 columns]

In [54]:
### Normilized the data into(0 or 1)
ks1["age in days"]=ks1["age in days"]/ks1["age in days"].max()
ks1.head()

C:\Users\Arbaz Arshad\AppData\Local\Temp\ipykernel_7880\4160530465.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ks1["age in days"]=ks1["age in days"]/ks1["age in days"].max()

    age in days     fare
1        0.4750  71.2833
3        0.4375  53.1000
6        0.6750  51.8625
10       0.0500  16.7000
11       0.7250  26.5500

In [55]:
ks1["fare"]=ks1["fare"]/ks1["fare"].max()
ks1.head()

C:\Users\Arbaz Arshad\AppData\Local\Temp\ipykernel_7880\750760767.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ks1["fare"]=ks1["fare"]/ks1["fare"].max()

    age in days      fare
1        0.4750  0.139136
3        0.4375  0.103644
6        0.6750  0.101229
10       0.0500  0.032596
11       0.7250  0.051822

In [56]:
## minmax method
ks1["fare"]=(ks1["fare"]-ks1['fare'].min()) / (ks1["fare"].max()-ks1["fare"].min())
ks1.head()

C:\Users\Arbaz Arshad\AppData\Local\Temp\ipykernel_7880\3882967466.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ks1["fare"]=(ks1["fare"]-ks1['fare'].min()) / (ks1["fare"].max()-ks1["fare"].min())

    age in days      fare
1        0.4750  0.139136
3        0.4375  0.103644
6        0.6750  0.101229
10       0.0500  0.032596
11       0.7250  0.051822

In [57]:
## zscore method
ks1["fare"]=(ks1["fare"]-ks1["fare"].mean())/ks1["fare"].std()

C:\Users\Arbaz Arshad\AppData\Local\Temp\ipykernel_7880\3156294505.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ks1["fare"]=(ks1["fare"]-ks1["fare"].mean())/ks1["fare"].std()

In [58]:
## log transfermation
ks1["fare"]=np.log(ks1['fare'])

c:\Users\Arbaz Arshad\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\core\arraylike.py:396: RuntimeWarning: invalid value encountered in log
  result = getattr(ufunc, method)(*inputs, **kwargs)
C:\Users\Arbaz Arshad\AppData\Local\Temp\ipykernel_7880\1191179800.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ks1["fare"]=np.log(ks1['fare'])

### Binning
- categorized the values into groups

In [59]:
##bins=np.linspace(min(kashti["age"]),max((kashti ["age"]),15000)
##age_group=["child","young","old"]
##kashti["age"]=pd.cut(kashti["age"],bins,labels=age_groups,include_lowest=True)

#### how we can convert the column categorical data into(0 and 1 form )

In [79]:
pd.get_dummies(ks1["fare"],axis=0)

TypeError: get_dummies() got an unexpected keyword argument 'axis'

In [73]:
kashti.head()

    female   male
1     True  False
3     True  False
6    False   True
10    True  False
11    True  False